leonlee-scut/JFlash_Devices_Gen/Puya.PY32F0xx_DFP.1.2.19.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.7.27"
  xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="https://raw.githubusercontent.com/Open-CMSIS-Pack/Open-CMSIS-Pack-Spec/v1.7.27/schema/PACK.xsd">
  <vendor>Puya</vendor>
  <url>https://www.puyasemi.com/uploadfiles/</url>
  <name>PY32F0xx_DFP</name>
  <description>Puya PY32F0 Series Device Support</description>
  <releases>
    <release version="1.2.19" date="2026-05-06">
        ADD PY32F020B .
    </release>
    <release version="1.2.18" date="2026-04-27">
        Update PY32F002X,add comp1/2 .
    </release>
    <release version="1.2.17" date="2026-04-15">
        Remove PY32F001B.
    </release>
    <release version="1.2.16" date="2026-03-30">
        Update PY32F005/032 interrupt and DbgMCUcfg.
        Update PY32F072E/040E/071E.
    </release>
    <release version="1.2.15" date="2026-01-07">
        upadte PY32F001B/F005/F032/F090/F092 Algorithm.
    </release>
    <release version="1.2.14" date="2025-12-29">
        upadte PY32F001B Algorithm.
        update PY32F090/F092 Interrupt and DbgMCUcfg.
    </release>
    <release version="1.2.13" date="2025-11-21">
        add PY32F006 svd.
    </release>
    <release version="1.2.12" date="2025-11-19">
        add PY32F001B svd.
        update PY32F031 DbgMCU.
    </release>
    <release version="1.2.11" date="2025-10-30">
        add PY32F005 svd.
        add PY32F002C svd.
        add PY32F0033 svd.
    </release>
    <release version="1.2.10" date="2025-10-15">
        add PY32F005 svd.
        add PY32F002C svd.
    </release>
    <release version="1.2.9" date="2025-09-17">
        update PY32F032 svd.
        update PY32F002C svd.
        Add PY32F090/092 series.
    </release>
    <release version="1.2.8" date="2025-07-28">
        Add PY32F002Z series.
    </release>
    <release version="1.2.7" date="2025-07-17">
        update PY32F040/071/072 series.
        Add OLD PY32F0xx FLM Files.
    </release>
    <release version="1.2.6" date="2025-06-23">
        Add PY32F001C series.
    </release>
    <release version="1.2.5" date="2025-06-11">
        Add PY32F040EPxB series.
    </release>
    <release version="1.2.4" date="2025-06-05">
        Add PY32F002C series.
    </release>
    <release version="1.2.3" date="2025-02-06">
        Add more series.
    </release>
    <release version="1.2.2" date="2024-10-30">
        Add more series.
    </release>
    <release version="1.2.1" date="2024-04-08">
        Fix some issues.
    </release>
    <release version="1.2.0" date="2023-08-23">
        Add more series.
    </release>
    <release version="1.1.0" date="2022-10-13">
        Add more series.
    </release>
    <release version="1.0.0" date="2022-09-22">
        First Release version of PY32F0 Device Family Pack.
    </release>
  </releases>
  <keywords>
    <keyword>Puya</keyword>
    <keyword>Device Support</keyword>
    <keyword>PY32F0</keyword>
  </keywords>
  <devices>
    <family Dfamily="PY32F0 Series" Dvendor="Puya:176">
      <description>
  The PY32F0 mainstream microcontrollers are based on high-performance Arm Cortex-M0+ 32-bit RISC core.

  The chip provides sleep and stop low-power operating modes to meet different low-power applications.
  Offering a high level of integration, they are suitable for a variety of application scenarios, such as controllers, handheld devices, PC peripherals, games and GPS platforms, industrial applications, etc.
      </description>

      <sequences>
        <!-- Override for Pre-Defined Sequences -->
        <sequence name="DebugCoreStart">
          <block>
            // Replication of Standard Functionality
            Write32(0xE000EDF0, 0xA05F0001);                                        // Enable Core Debug via DHCSR
          </block>

          <block info="DbgMCU registers">
            // Device Specific Debug Setup
            Write32(0x4002103C, Read32(0x4002103C) | 0x08000000);                   // Set RCC_APBENR1.DBGEN

            Write32(0x40015804, DbgMCU_CR);                                         // DBGMCU_CR: Configure MCU Debug
            Write32(0x40015808, DbgMCU_APB_Fz1);                                    // DBGMCU_APB_FZ1: Configure APB Peripheral Freeze1 Behavior
            Write32(0x4001580C, DbgMCU_APB_Fz2);                                    // DBGMCU_APB_FZ2: Configure APB Peripheral Freeze2 Behavior
          </block>
        </sequence>
      </sequences>


      <!-- ************************  Subfamily 'PY32F001C'  **************************** -->
      <subFamily DsubFamily="PY32F001C">
        <processor Dclock="48000000" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
        <debug svd="CMSIS/SVD/PY32F001Cxx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32F001Cxx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>

        <memory name="OB" access="rx" start="0x1FFF0040" size="0x00000040" />
        <memory name="OTP" access="rx" start="0x1FFF01C0" size="0x00000040" />
        <algorithm name="CMSIS/Flash/PY107xx_OB.FLM" start="0x1FFF0040" size="0x00000040" default="0"/>
        <algorithm name="CMSIS/Flash/PY107xx_OTP.FLM" start="0x1FFF01C0" size="0x00000040" default="0"/>

        <!-- *************************  Device 'PY32F001Cx4'  ***************************** -->
        <device Dname="PY32F001Cx4">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY107xx_16.FLM" start="0x08000000" size="0x00004000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'PY32F002A'  **************************** -->
      <subFamily DsubFamily="PY32F002A">
        <processor Dclock="48000000" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
        <debug svd="CMSIS/SVD/PY32F002Axx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32F002Axx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>

        <memory name="OB" access="rx" start="0x1FFF0E80" size="0x00000010" />
        <algorithm name="CMSIS/Flash/PY061xx_OB.FLM" start="0x1FFF0E80" size="0x00000010" default="0"/>

        <!-- *************************  Device 'PY32F002Ax5'  ***************************** -->
        <device Dname="PY32F002Ax5">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x00005000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00000C00" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY061xx_20.FLM" start="0x08000000" size="0x00005000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'PY32F002B'  **************************** -->
      <subFamily DsubFamily="PY32F002B">
        <processor Dclock="48000000" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
        <debug svd="CMSIS/SVD/PY32F002Bxx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32F002Bxx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>

        <memory name="OB" access="rx" start="0x1FFF0080" size="0x00000010" />
        <memory name="OTP" access="rx" start="0x1FFF0280" size="0x00000080" />
        <algorithm name="CMSIS/Flash/PY064xx_OB.FLM" start="0x1FFF0080" size="0x00000010" default="0"/>
        <algorithm name="CMSIS/Flash/PY064xx_OTP.FLM" start="0x1FFF0280" size="0x00000080" default="0"/>

