leonlee-scut/JFlash_Devices_Gen/Puya.PY32F0xx_DFP.1.2.19.pdsc
        <!-- *************************  Device 'PY32F002Bx5'  ***************************** -->
        <device Dname="PY32F002Bx5">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x00006000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00000C00" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY064xx_24.FLM" start="0x08000000" size="0x00006000" default="1"/>
        </device>
      </subFamily>


      <!-- ************************  Subfamily 'PY32F002C'  **************************** -->
      <subFamily DsubFamily="PY32F002C">
        <processor Dclock="48000000" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
        <debug svd="CMSIS/SVD/PY32F002Cxx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32F002Cxx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>

        <memory name="OB" access="rx" start="0x1FFF0080" size="0x00000010" />
        <memory name="OTP" access="rx" start="0x1FFF0280" size="0x00000080" />
        <algorithm name="CMSIS/Flash/PY108xx_OB.FLM" start="0x1FFF0080" size="0x00000010" default="0"/>
        <algorithm name="CMSIS/Flash/PY108xx_OTP.FLM" start="0x1FFF0280" size="0x00000080" default="0"/>

        <!-- *************************  Device 'PY32F002Cx6'  ***************************** -->
        <device Dname="PY32F002Cx6">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00000C00" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY108xx_32.FLM" start="0x08000000" size="0x00008000" default="1"/>
        </device>

        <!-- *************************  Device 'PY32F002Cx5'  ***************************** -->
        <device Dname="PY32F002Cx5">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x00006000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00000C00" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY108xx_24.FLM" start="0x08000000" size="0x00006000" default="1"/>
        </device>

      </subFamily>

      <!-- ************************  Subfamily 'PY32F002Z'  **************************** -->
      <subFamily DsubFamily="PY32F002Z">
        <processor Dclock="24000000" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
        <debug svd="CMSIS/SVD/PY32F002Zxx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32F002Zxx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>

        <memory name="OB" access="rx" start="0x1FFF0080" size="0x00000010" />
        <memory name="OTP" access="rx" start="0x1FFF0280" size="0x00000080" />
        <algorithm name="CMSIS/Flash/PY064xx_OB.FLM" start="0x1FFF0080" size="0x00000010" default="0"/>
        <algorithm name="CMSIS/Flash/PY064xx_OTP.FLM" start="0x1FFF0280" size="0x00000080" default="0"/>

        <!-- *************************  Device 'PY32F002Zx4'  ***************************** -->
        <device Dname="PY32F002Zx4">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00000C00" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY064xx_16.FLM" start="0x08000000" size="0x00004000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'PY32F002X'  **************************** -->
      <subFamily DsubFamily="PY32F002X">
        <processor Dclock="48000000" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
        <debug svd="CMSIS/SVD/PY32F002Xxx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32F002Bxx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>

        <memory name="OB" access="rx" start="0x1FFF0080" size="0x00000010" />
        <memory name="OTP" access="rx" start="0x1FFF0280" size="0x00000080" />
        <algorithm name="CMSIS/Flash/PY064xx_OB.FLM" start="0x1FFF0080" size="0x00000010" default="0"/>
        <algorithm name="CMSIS/Flash/PY064xx_OTP.FLM" start="0x1FFF0280" size="0x00000080" default="0"/>

        <!-- *************************  Device 'PY32F002Xx2'  ***************************** -->
        <device Dname="PY32F002Xx2">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00000C00" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY064xx_24.FLM" start="0x08000000" size="0x00002000" default="1"/>
        </device>
