leonlee-scut/JFlash_Devices_Gen/Puya.PY32F0xx_DFP.1.2.19.pdsc
        <!-- *************************  Device 'PY32F002Xx4'  ***************************** -->
        <device Dname="PY32F002Xx4">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00000C00" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY064xx_24.FLM" start="0x08000000" size="0x00004000" default="1"/>
        </device>      
        <!-- *************************  Device 'PY32F002Xx5'  ***************************** -->
        <device Dname="PY32F002Xx5">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x00006000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00000C00" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY064xx_24.FLM" start="0x08000000" size="0x00006000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'PY32F003'  **************************** -->
      <subFamily DsubFamily="PY32F003">
        <processor Dclock="48000000" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
        <debug svd="CMSIS/SVD/PY32F003xx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32F003xx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>

        <memory name="OB" access="rx" start="0x1FFF0E80" size="0x00000010" />
        <algorithm name="CMSIS/Flash/PY061xx_OB.FLM" start="0x1FFF0E80" size="0x00000010" default="0"/>

        <!-- *************************  Device 'PY32F003x4'  ***************************** -->
        <device Dname="PY32F003x4">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY061xx_16.FLM" start="0x08000000" size="0x00004000" default="1"/>
        </device>

        <!-- *************************  Device 'PY32F003x6'  ***************************** -->
        <device Dname="PY32F003x6">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY061xx_32.FLM" start="0x08000000" size="0x00008000" default="1"/>
        </device>

        <!-- *************************  Device 'PY32F003x7'  ***************************** -->
        <device Dname="PY32F003x7">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x0000C000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00001800" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY061xx_48.FLM" start="0x08000000" size="0x0000C000" default="1"/>
        </device>

        <!-- *************************  Device 'PY32F003x8'  ***************************** -->
        <device Dname="PY32F003x8">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY061xx_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>
      </subFamily>


      <!-- ************************  Subfamily 'PY32F005'  **************************** -->
      <subFamily DsubFamily="PY32F005">
        <processor Dclock="48000000" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
        <debug svd="CMSIS/SVD/PY32F005xx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32F005xx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>

        <memory name="OB" access="rx" start="0x1FFF0080" size="0x00000010" />
        <memory name="OTP" access="rx" start="0x1FFF0280" size="0x00000080" />
        <algorithm name="CMSIS/Flash/PY108xx_OB.FLM" start="0x1FFF0080" size="0x00000010" default="0"/>
        <algorithm name="CMSIS/Flash/PY108xx_OTP.FLM" start="0x1FFF0280" size="0x00000080" default="0"/>

        <!-- *************************  Device 'PY32F005x6'  ***************************** -->
        <device Dname="PY32F005x6">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00000C00" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY108xx_32.FLM" start="0x08000000" size="0x00008000" default="1"/>
        </device>
      </subFamily>


      <!-- ************************  Subfamily 'PY32F006'  **************************** -->
      <subFamily DsubFamily="PY32F006">
        <processor Dclock="48000000" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
        <debug svd="CMSIS/SVD/PY32F006xx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32F006xx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>
        
        <memory name="OB" access="rx" start="0x1FFF0F80" size="0x00000020" />
        <memory name="OTP" access="rx" start="0x1FFF0E00" size="0x00000080" />
        <algorithm name="CMSIS/Flash/PY106xx_OB.FLM" start="0x1FFF0F80" size="0x00000020" default="0"/>
        <algorithm name="CMSIS/Flash/PY106xx_OTP.FLM" start="0x1FFF0E00" size="0x00000080" default="0"/>

        <!-- *************************  Device 'PY32F006x8'  ***************************** -->
        <device Dname="PY32F006x8">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY106xx_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'PY32F020B'  **************************** -->
      <subFamily DsubFamily="PY32F020B">
        <processor Dclock="48000000" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
        <debug svd="CMSIS/SVD/PY32F020Bxx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32F020Bxx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>
        <memory name="OB" access="r" start="0x1FFF0080" size="0x00000010" />
        <algorithm name="CMSIS/Flash/PY068xx_OB.FLM" start="0x1FFF0080" size="0x00000010" default="0"/>

