leonlee-scut/JFlash_Devices_Gen/Puya.PY32F0xx_DFP.1.2.19.pdsc
        <!-- *************************  Device 'PY32F032x8'  ***************************** -->
        <device Dname="PY32F032x8">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY106xx_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'PY32F033'  **************************** -->
      <subFamily DsubFamily="PY32F033">
        <processor Dclock="48000000" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
        <debug svd="CMSIS/SVD/PY32F033xx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32F033xx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>
        
        <memory name="OB" access="rx" start="0x1FFF0F80" size="0x00000020" />
        <memory name="OTP" access="rx" start="0x1FFF0E00" size="0x00000080" />
        <algorithm name="CMSIS/Flash/PY106xx_OB.FLM" start="0x1FFF0F80" size="0x00000020" default="0"/>
        <algorithm name="CMSIS/Flash/PY106xx_OTP.FLM" start="0x1FFF0E00" size="0x00000080" default="0"/>

        <!-- *************************  Device 'PY32F033x8'  ***************************** -->
        <device Dname="PY32F033x8">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY106xx_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'PY32F040'  **************************** -->
      <subFamily DsubFamily="PY32F040">
        <processor Dclock="48000000" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
        <debug svd="CMSIS/SVD/PY32F040xx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32F040xx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>
        <sequences>
          <!-- Override for Pre-Defined Sequences -->
          <sequence name="DebugCoreStart">
            <block>
            // Replication of Standard Functionality
            Write32(0xE000EDF0, 0xA05F0001);                                        // Enable Core Debug via DHCSR
            </block>

            <block info="DbgMCU registers">
            // Device Specific Debug Setup
            Write32(0x40021040, Read32(0x40021040) | 0x00000400);                   // Set RCC_APBENR1.DBGEN

            Write32(0x40015804, DbgMCU_CR);                                         // DBGMCU_CR: Configure MCU Debug
            Write32(0x40015808, DbgMCU_APB_Fz1);                                    // DBGMCU_APB_FZ1: Configure APB Peripheral Freeze1 Behavior
            Write32(0x4001580C, DbgMCU_APB_Fz2);                                    // DBGMCU_APB_FZ2: Configure APB Peripheral Freeze2 Behavior
            </block>
          </sequence>
        </sequences>

        <memory name="OB" access="rx" start="0x1FFF3100" size="0x00000020" />
        <algorithm name="CMSIS/Flash/PY063xx_OB.FLM" start="0x1FFF3100" size="0x00000020" default="0"/>

        <!-- *************************  Device 'PY32F040x6'  ***************************** -->
        <device Dname="PY32F040x6">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY063xx_32.FLM" start="0x08000000" size="0x00008000" default="1"/>
        </device>

        <!-- *************************  Device 'PY32F040x8'  ***************************** -->
        <device Dname="PY32F040x8">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY063xx_64.FLM" start="0x08000000" size="0x00010000" default="1"/>
        </device>

        <!-- *************************  Device 'PY32F040x9'  ***************************** -->
        <device Dname="PY32F040x9">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x00018000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00003000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY063xx_96.FLM" start="0x08000000" size="0x00018000" default="1"/>
        </device>

        <!-- *************************  Device 'PY32F040xB'  ***************************** -->
        <device Dname="PY32F040xB">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY063xx_128.FLM" start="0x08000000" size="0x00020000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'PY32F040C'  **************************** -->
      <subFamily DsubFamily="PY32F040C">
        <processor Dclock="48000000" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
        <debug svd="CMSIS/SVD/PY32F040Cxx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32F040xx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>
        <sequences>
          <!-- Override for Pre-Defined Sequences -->
          <sequence name="DebugCoreStart">
            <block>
            // Replication of Standard Functionality
            Write32(0xE000EDF0, 0xA05F0001);                                        // Enable Core Debug via DHCSR
            </block>

            <block info="DbgMCU registers">
            // Device Specific Debug Setup
            Write32(0x40021040, Read32(0x40021040) | 0x00000400);                   // Set RCC_APBENR1.DBGEN

