leonlee-scut/JFlash_Devices_Gen/Puya.PY32F0xx_DFP.1.2.19.pdsc
        <memory name="OB" access="r" start="0x1FFF1D00" size="0x00000040" />
        <memory name="OTP" access="r" start="0x1FFF1A00" size="0x00000100" />
        <algorithm name="CMSIS/Flash/PY088xx_OB.FLM" start="0x1FFF1D00" size="0x00000040" default="0"/>
        <algorithm name="CMSIS/Flash/PY088xx_OTP.FLM" start="0x1FFF1A00" size="0x00000100" default="0"/>

        <!-- *************************  Device 'PY32F090xB'  ***************************** -->
        <device Dname="PY32F090xB">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY088xx_128.FLM" start="0x08000000" size="0x00020000" default="1"/>
        </device>

        <!-- *************************  Device 'PY32F090xC'  ***************************** -->
        <device Dname="PY32F090xC">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY088xx_256.FLM" start="0x08000000" size="0x00040000" default="1"/>
        </device>

      </subFamily>

      <!-- ************************  Subfamily 'PY32F092'  **************************** -->
      <subFamily DsubFamily="PY32F092">
        <processor Dclock="48000000" Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
        <debug svd="CMSIS/SVD/PY32F092xx.svd"/>
        <debugvars configfile="CMSIS/Debug/PY32F092xx.dbgconf">
          __var DbgMCU_CR      = 0x00000002;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB_Fz1 = 0x00000000;   // DGBMCU_APB_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB_Fz2 = 0x00000000;   // DGBMCU_APB_FZ2: All Peripherals Operate as in Normal Mode
        </debugvars>

        <sequences>
          <!-- Override for Pre-Defined Sequences -->
          <sequence name="DebugCoreStart">
            <block>
            // Replication of Standard Functionality
            Write32(0xE000EDF0, 0xA05F0001);                                        // Enable Core Debug via DHCSR
            </block>

            <block info="DbgMCU registers">
            // Device Specific Debug Setup
            Write32(0x40021040, Read32(0x40021040) | 0x00000400);                   // Set RCC_APBENR1.DBGEN

            Write32(0x40015804, DbgMCU_CR);                                         // DBGMCU_CR: Configure MCU Debug
            Write32(0x40015808, DbgMCU_APB_Fz1);                                    // DBGMCU_APB_FZ1: Configure APB Peripheral Freeze1 Behavior
            Write32(0x4001580C, DbgMCU_APB_Fz2);                                    // DBGMCU_APB_FZ2: Configure APB Peripheral Freeze2 Behavior
            </block>
          </sequence>
        </sequences>

        <memory name="OB" access="r" start="0x1FFF1D00" size="0x00000040" />
        <memory name="OTP" access="r" start="0x1FFF1A00" size="0x00000100" />
        <algorithm name="CMSIS/Flash/PY088xx_OB.FLM" start="0x1FFF1D00" size="0x00000040" default="0"/>
        <algorithm name="CMSIS/Flash/PY088xx_OTP.FLM" start="0x1FFF1A00" size="0x00000100" default="0"/>

        <!-- *************************  Device 'PY32F092xC'  ***************************** -->
        <device Dname="PY32F092xC">
          <compile header="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h" />
          <memory id="IROM1" name="Flash" access="rx" start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1" name="SRAM1" access="rwx" start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/PY088xx_256.FLM" start="0x08000000" size="0x00040000" default="1"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="PY32F0">
      <description>Puya PYF0 Series Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F0*"/>
    </condition>

    <condition id="PY32F0 CMSIS">
      <description>Puya PY32F0 Series devices and CMSIS</description>
      <require condition="PY32F0"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>


    <condition id="PY32F001Cx4">
      <description>Puya PY32F001Cx4 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F001C?4*"/>
    </condition>
    <condition id="PY32F001C">
      <description>Puya PY32F001C Devices</description>
      <accept condition="PY32F001Cx4" />
    </condition>

    <condition id="PY32F002Ax5">
      <description>Puya PY32F002Ax5 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F002A?5*"/>
    </condition>
    <condition id="PY32F002A">
      <description>Puya PY32F002A Devices</description>
      <accept condition="PY32F002Ax5" />
    </condition>

    <condition id="PY32F002Bx5">
      <description>Puya PY32F002Bx5 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F002B?5*"/>
    </condition>
    <condition id="PY32F002B">
      <description>Puya PY32F002B Devices</description>
      <accept condition="PY32F002Bx5" />
    </condition>

    <condition id="PY32F002Cx5">
      <description>Puya PY32F002Cx5 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F002C?5*"/>
    </condition>
    <condition id="PY32F002Cx6">
      <description>Puya PY32F002Cx6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F002C?6*"/>
    </condition>
    <condition id="PY32F002C">
      <description>Puya PY32F002C Devices</description>
      <accept condition="PY32F002Cx6" />
      <accept condition="PY32F002Cx5" />
    </condition>

    <condition id="PY32F002Xx2">
      <description>Puya PY32F002Xx2 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F002X?2*"/>
    </condition>
