leonlee-scut/JFlash_Devices_Gen/Puya.PY32F0xx_DFP.1.2.19.pdsc
    <condition id="PY32F002Xx4">
      <description>Puya PY32F002Xx4 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F002X?4*"/>
    </condition>
    <condition id="PY32F002Xx5">
      <description>Puya PY32F002Xx5 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F002X?5*"/>
    </condition>
    <condition id="PY32F002X">
      <description>Puya PY32F002X Devices</description>
      <accept condition="PY32F002Xx2" />
      <accept condition="PY32F002Xx4" />
      <accept condition="PY32F002Xx5" />
    </condition>

    <condition id="PY32F002Zx4">
      <description>Puya PY32F002Zx4 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F002Z?4*"/>
    </condition>
    <condition id="PY32F002Z">
      <description>Puya PY32F002Z Devices</description>
      <accept condition="PY32F002Zx4" />
    </condition>

    <condition id="PY32F003x4">
      <description>Puya PY32F003x4 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F003?4*"/>
    </condition>
    <condition id="PY32F003x6">
      <description>Puya PY32F003x6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F003?6*"/>
    </condition>
    <condition id="PY32F003x7">
      <description>Puya PY32F003x7 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F003?7*"/>
    </condition>
    <condition id="PY32F003x8">
      <description>Puya PY32F003x8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F003?8*"/>
    </condition>
    <condition id="PY32F003">
      <description>Puya PY32F003 Devices</description>
      <accept condition="PY32F003x4" />
      <accept condition="PY32F003x6" />
      <accept condition="PY32F003x7" />
      <accept condition="PY32F003x8" />
    </condition>


    <condition id="PY32F005x6">
      <description>Puya PY32F005x6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F005?6*"/>
    </condition>
    <condition id="PY32F005">
      <description>Puya PY32F005 Devices</description>
      <accept condition="PY32F005x6" />
    </condition>


    <condition id="PY32F006x8">
      <description>Puya PY32F006x8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F006?8*"/>
    </condition>
    <condition id="PY32F006">
      <description>Puya PY32F006 Devices</description>
      <accept condition="PY32F006x8" />
    </condition>

    <condition id="PY32F020Bx6">
      <description>Puya PY32F020Bx6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F020B?6*"/>
    </condition>
    <condition id="PY32F020B">
      <description>Puya PY32F020B Devices</description>
      <accept condition="PY32F020Bx6" />
    </condition>

    <condition id="PY32F021x8">
      <description>Puya PY32F021x8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F021?8*"/>
    </condition>
    <condition id="PY32F021">
      <description>Puya PY32F021 Devices</description>
      <accept condition="PY32F021x8" />
    </condition>

    <condition id="PY32F030x4">
      <description>Puya PY32F030x4 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F030?4*"/>
    </condition>
    <condition id="PY32F030x6">
      <description>Puya PY32F030x6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F030?6*"/>
    </condition>
    <condition id="PY32F030x7">
      <description>Puya PY32F030x7 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F030?7*"/>
    </condition>
    <condition id="PY32F030x8">
      <description>Puya PY32F030x8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F030?8*"/>
    </condition>
    <condition id="PY32F030">
      <description>Puya PY32F030 Devices</description>
      <accept condition="PY32F030x4" />
      <accept condition="PY32F030x6" />
      <accept condition="PY32F030x7" />
      <accept condition="PY32F030x8" />
    </condition>

    <condition id="PY32F031x4">
      <description>Puya PY32F031x4 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F031?4*"/>
    </condition>
    <condition id="PY32F031x6">
      <description>Puya PY32F031x6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F031?6*"/>
    </condition>
    <condition id="PY32F031x7">
      <description>Puya PY32F031x7 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F031?7*"/>
    </condition>
    <condition id="PY32F031x8">
      <description>Puya PY32F031x8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F031?8*"/>
    </condition>
    <condition id="PY32F031">
      <description>Puya PY32F031 Devices</description>
      <accept condition="PY32F031x4" />
      <accept condition="PY32F031x6" />
      <accept condition="PY32F031x7" />
      <accept condition="PY32F031x8" />
    </condition>

    <condition id="PY32F032x8">
      <description>Puya PY32F032x8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F032?8*"/>
    </condition>
    <condition id="PY32F032">
      <description>Puya PY32F032 Devices</description>
      <accept condition="PY32F032x8" />
    </condition>

    <condition id="PY32F033x8">
      <description>Puya PY32F033x8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F033?8*"/>
    </condition>
    <condition id="PY32F033">
      <description>Puya PY32F033 Devices</description>
      <accept condition="PY32F033x8" />
    </condition>

    <condition id="PY32F040x6">
      <description>Puya PY32F040x6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F040?6*"/>
    </condition>
    <condition id="PY32F040x8">
      <description>Puya PY32F040x8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F040?8*"/>
    </condition>
    <condition id="PY32F040x9">
      <description>Puya PY32F040x9 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F040?9*"/>
    </condition>
    <condition id="PY32F040xB">
      <description>Puya PY32F040xB Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F040?B*"/>
    </condition>
    <condition id="PY32F040">
      <description>Puya PY32F040 Devices</description>
      <accept condition="PY32F040x6" />
      <accept condition="PY32F040x8" />
      <accept condition="PY32F040x9" />
      <accept condition="PY32F040xB" />
    </condition>

    <condition id="PY32F040Cx6">
      <description>Puya PY32F040Cx6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F040C?6*"/>
    </condition>
    <condition id="PY32F040Cx8">
      <description>Puya PY32F040Cx8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F040C?8*"/>
    </condition>
