leonlee-scut/JFlash_Devices_Gen/Puya.PY32F0xx_DFP.1.2.19.pdsc
    <condition id="PY32F040Cx9">
      <description>Puya PY32F040Cx9 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F040C?9*"/>
    </condition>
    <condition id="PY32F040CxB">
      <description>Puya PY32F040CxB Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F040C?B*"/>
    </condition>
    <condition id="PY32F040Ex6">
      <description>Puya PY32F040Ex6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F040E?6*"/>
    </condition>
    <condition id="PY32F040Ex8">
      <description>Puya PY32F040Ex8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F040E?8*"/>
    </condition>
    <condition id="PY32F040Ex9">
      <description>Puya PY32F040Ex9 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F040E?9*"/>
    </condition>
    <condition id="PY32F040ExB">
      <description>Puya PY32F040ExB Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F040E?B*"/>
    </condition>
    <condition id="PY32F040EPxB">
      <description>Puya PY32F040EPxB Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F040EP?B*"/>
    </condition>
    <condition id="PY32F040E">
      <description>Puya PY32F040E Devices</description>
      <accept condition="PY32F040Cx6" />
      <accept condition="PY32F040Cx8" />
      <accept condition="PY32F040Cx9" />
      <accept condition="PY32F040CxB" />
      <accept condition="PY32F040Ex6" />
      <accept condition="PY32F040Ex8" />
      <accept condition="PY32F040Ex9" />
      <accept condition="PY32F040ExB" />
      <accept condition="PY32F040EPxB" />
    </condition>

    <condition id="PY32F071x6">
      <description>Puya PY32F071x6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F071?6*"/>
    </condition>
    <condition id="PY32F071x8">
      <description>Puya PY32F071x8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F071?8*"/>
    </condition>
    <condition id="PY32F071x9">
      <description>Puya PY32F071x9 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F071?9*"/>
    </condition>
    <condition id="PY32F071xB">
      <description>Puya PY32F071xB Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F071?B*"/>
    </condition>
    <condition id="PY32F071">
      <description>Puya PY32F071 Devices</description>
      <accept condition="PY32F071x6" />
      <accept condition="PY32F071x8" />
      <accept condition="PY32F071x9" />
      <accept condition="PY32F071xB" />
    </condition>

    <condition id="PY32F071Cx6">
      <description>Puya PY32F071Cx6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F071C?6*"/>
    </condition>
    <condition id="PY32F071Cx8">
      <description>Puya PY32F071Cx8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F071C?8*"/>
    </condition>
    <condition id="PY32F071Cx9">
      <description>Puya PY32F071Cx9 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F071C?9*"/>
    </condition>
    <condition id="PY32F071CxB">
      <description>Puya PY32F071CxB Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F071C?B*"/>
    </condition>
    <condition id="PY32F071Ex6">
      <description>Puya PY32F071Ex6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F071E?6*"/>
    </condition>
    <condition id="PY32F071Ex8">
      <description>Puya PY32F071Ex8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F071E?8*"/>
    </condition>
    <condition id="PY32F071Ex9">
      <description>Puya PY32F071Ex9 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F071E?9*"/>
    </condition>
    <condition id="PY32F071ExB">
      <description>Puya PY32F071ExB Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F071E?B*"/>
    </condition>
    <condition id="PY32F071E">
      <description>Puya PY32F071E Devices</description>
      <accept condition="PY32F071Cx6" />
      <accept condition="PY32F071Cx8" />
      <accept condition="PY32F071Cx9" />
      <accept condition="PY32F071CxB" />
      <accept condition="PY32F071Ex6" />
      <accept condition="PY32F071Ex8" />
      <accept condition="PY32F071Ex9" />
      <accept condition="PY32F071ExB" />
    </condition>


    <condition id="PY32F072x6">
      <description>Puya PY32F072x6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F072?6*"/>
    </condition>
    <condition id="PY32F072x8">
      <description>Puya PY32F072x8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F072?8*"/>
    </condition>
    <condition id="PY32F072x9">
      <description>Puya PY32F072x9 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F072?9*"/>
    </condition>
    <condition id="PY32F072xB">
      <description>Puya PY32F072xB Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F072?B*"/>
    </condition>
    <condition id="PY32F072">
      <description>Puya PY32F072 Devices</description>
      <accept condition="PY32F072x6" />
      <accept condition="PY32F072x8" />
      <accept condition="PY32F072x9" />
      <accept condition="PY32F072xB" />
    </condition>

    <condition id="PY32F072Cx6">
      <description>Puya PY32F072Cx6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F072C?6*"/>
    </condition>
    <condition id="PY32F072Cx8">
      <description>Puya PY32F072Cx8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F072C?8*"/>
    </condition>
    <condition id="PY32F072Cx9">
      <description>Puya PY32F072Cx9 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F072C?9*"/>
    </condition>
    <condition id="PY32F072CxB">
      <description>Puya PY32F072CxB Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F072C?B*"/>
    </condition>
    <condition id="PY32F072Ex6">
      <description>Puya PY32F072Ex6 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F072E?6*"/>
    </condition>
    <condition id="PY32F072Ex8">
      <description>Puya PY32F072Ex8 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F072E?8*"/>
    </condition>
    <condition id="PY32F072Ex9">
      <description>Puya PY32F072Ex9 Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F072E?9*"/>
    </condition>
    <condition id="PY32F072ExB">
      <description>Puya PY32F072ExB Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F072E?B*"/>
    </condition>

    <condition id="PY32F072E">
      <description>Puya PY32F072E Devices</description>
      <accept condition="PY32F072Cx6" />
      <accept condition="PY32F072Cx8" />
      <accept condition="PY32F072Cx9" />
      <accept condition="PY32F072CxB" />
      <accept condition="PY32F072Ex6" />
      <accept condition="PY32F072Ex8" />
      <accept condition="PY32F072Ex9" />
      <accept condition="PY32F072ExB" />
    </condition>

