leonlee-scut/JFlash_Devices_Gen/Puya.PY32F0xx_DFP.1.2.19.pdsc
    <condition id="PY32F090xB">
      <description>Puya PY32F090xB Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F090?B*"/>
    </condition>

    <condition id="PY32F090xC">
      <description>Puya PY32F090xC Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F090?C*"/>
    </condition>

    <condition id="PY32F090">
      <description>Puya PY32F090 Devices</description>
      <accept condition="PY32F090xB" />
      <accept condition="PY32F090xC" />
    </condition>

    <condition id="PY32F092xC">
      <description>Puya PY32F092xC Devices</description>
      <require Dvendor="Puya:176" Dname="PY32F092?C*"/>
    </condition>

    <condition id="PY32F092">
      <description>Puya PY32F092 Devices</description>
      <accept condition="PY32F092xC" />
    </condition>

    <condition id="PY32F001C ARMCC">
      <description>Puya PY32F001C Devices and ARMCC Compiler</description>
      <require condition="PY32F001C"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="PY32F001C CMSIS">
      <description>Puya PY32F001C Devices and CMSIS-CORE</description>
      <require condition="PY32F001C"/>
      <require Cclass="CMSIS" Cgroup="CORE" />
    </condition>

    <condition id="PY32F002A ARMCC">
      <description>Puya PY32F002A Devices and ARMCC Compiler</description>
      <require condition="PY32F002A"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="PY32F002A CMSIS">
      <description>Puya PY32F002A Devices and CMSIS-CORE</description>
      <require condition="PY32F002A"/>
      <require Cclass="CMSIS" Cgroup="CORE" />
    </condition>

    <condition id="PY32F002B ARMCC">
      <description>Puya PY32F002B Devices and ARMCC Compiler</description>
      <require condition="PY32F002B"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="PY32F002B CMSIS">
      <description>Puya PY32F002B Devices and CMSIS-CORE</description>
      <require condition="PY32F002B"/>
      <require Cclass="CMSIS" Cgroup="CORE" />
    </condition>

    <condition id="PY32F002C ARMCC">
      <description>Puya PY32F002C Devices and ARMCC Compiler</description>
      <require condition="PY32F002C"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="PY32F002C CMSIS">
      <description>Puya PY32F002C Devices and CMSIS-CORE</description>
      <require condition="PY32F002C"/>
      <require Cclass="CMSIS" Cgroup="CORE" />
    </condition>

    <condition id="PY32F002X ARMCC">
      <description>Puya PY32F002X Devices and ARMCC Compiler</description>
      <require condition="PY32F002X"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="PY32F002X CMSIS">
      <description>Puya PY32F002X Devices and CMSIS-CORE</description>
      <require condition="PY32F002X"/>
      <require Cclass="CMSIS" Cgroup="CORE" />
    </condition>

    <condition id="PY32F002Z ARMCC">
      <description>Puya PY32F002Z Devices and ARMCC Compiler</description>
      <require condition="PY32F002Z"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="PY32F002Z CMSIS">
      <description>Puya PY32F002Z Devices and CMSIS-CORE</description>
      <require condition="PY32F002Z"/>
      <require Cclass="CMSIS" Cgroup="CORE" />
    </condition>

    <condition id="PY32F003 ARMCC">
      <description>Puya PY32F003 Devices and ARMCC Compiler</description>
      <require condition="PY32F003"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="PY32F003 CMSIS">
      <description>Puya PY32F003 Devices and CMSIS-CORE</description>
      <require condition="PY32F003"/>
      <require Cclass="CMSIS" Cgroup="CORE" />
    </condition>

    <condition id="PY32F005 ARMCC">
      <description>Puya PY32F005 Devices and ARMCC Compiler</description>
      <require condition="PY32F005"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="PY32F005 CMSIS">
      <description>Puya PY32F005 Devices and CMSIS-CORE</description>
      <require condition="PY32F005"/>
      <require Cclass="CMSIS" Cgroup="CORE" />
    </condition>

    <condition id="PY32F006 ARMCC">
      <description>Puya PY32F006 Devices and ARMCC Compiler</description>
      <require condition="PY32F006"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="PY32F006 CMSIS">
      <description>Puya PY32F006 Devices and CMSIS-CORE</description>
      <require condition="PY32F006"/>
      <require Cclass="CMSIS" Cgroup="CORE" />
    </condition>

    <condition id="PY32F020B ARMCC">
      <description>Puya PY32F020B Devices and ARMCC Compiler</description>
      <require condition="PY32F020B"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="PY32F020B CMSIS">
      <description>Puya PY32F020B Series Devices and CMSIS-CORE</description>
      <require condition="PY32F020B"/>
      <require Cclass="CMSIS" Cgroup="CORE" />
    </condition>

    <condition id="PY32F021 ARMCC">
      <description>Puya PY32F021 Devices and ARMCC Compiler</description>
      <require condition="PY32F021"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="PY32F021 CMSIS">
      <description>Puya PY32F021 Series Devices and CMSIS-CORE</description>
      <require condition="PY32F021"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="PY32F030 ARMCC">
      <description>Puya PY32F030 Devices and ARMCC Compiler</description>
      <require condition="PY32F030"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="PY32F030 CMSIS">
      <description>Puya PY32F030 Series Devices and CMSIS-CORE</description>
      <require condition="PY32F030"/>
      <require Cclass="CMSIS" Cgroup="CORE" />
    </condition>


    <condition id="PY32F031 ARMCC">
      <description>Puya PY32F031 Devices and ARMCC Compiler</description>
      <require condition="PY32F031"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="PY32F031 CMSIS">
      <description>Puya PY32F031 Devices and CMSIS-CORE</description>
      <require condition="PY32F031"/>
      <require Cclass="CMSIS" Cgroup="CORE" />
    </condition>

    <condition id="PY32F032 ARMCC">
      <description>Puya PY32F032 Devices and ARMCC Compiler</description>
      <require condition="PY32F032"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="PY32F032 CMSIS">
      <description>Puya PY32F032 Devices and CMSIS-CORE</description>
      <require condition="PY32F032"/>
      <require Cclass="CMSIS" Cgroup="CORE" />
    </condition>

    <condition id="PY32F033 ARMCC">
      <description>Puya PY32F033 Devices and ARMCC Compiler</description>
      <require condition="PY32F033"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="PY32F033 CMSIS">
      <description>Puya PY32F033 Devices and CMSIS-CORE</description>
      <require condition="PY32F033"/>
      <require Cclass="CMSIS" Cgroup="CORE" />
    </condition>

    <condition id="PY32F040 ARMCC">
      <description>Puya PY32F040 Devices and ARMCC Compiler</description>
      <require condition="PY32F040"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="PY32F040 CMSIS">
      <description>Puya PY32F040 Devices and CMSIS-CORE</description>
      <require condition="PY32F040"/>
      <require Cclass="CMSIS" Cgroup="CORE" />
    </condition>

    <condition id="PY32F040E ARMCC">
      <description>Puya PY32F040E Devices and ARMCC Compiler</description>
      <require condition="PY32F040E"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="PY32F040E CMSIS">
      <description>Puya PY32F040E Devices and CMSIS-CORE</description>
      <require condition="PY32F040E"/>
      <require Cclass="CMSIS" Cgroup="CORE" />
    </condition>

    <condition id="PY32F071 ARMCC">
      <description>Puya PY32F071 Devices and ARMCC Compiler</description>
      <require condition="PY32F071"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="PY32F071 CMSIS">
      <description>Puya PY32F071 Devices and CMSIS-CORE</description>
      <require condition="PY32F071"/>
      <require Cclass="CMSIS" Cgroup="CORE" />
    </condition> 

    <condition id="PY32F071E ARMCC">
      <description>Puya PY32F071E Devices and ARMCC Compiler</description>
      <require condition="PY32F071E"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="PY32F071E CMSIS">
      <description>Puya PY32F071E Devices and CMSIS-CORE</description>
      <require condition="PY32F071E"/>
      <require Cclass="CMSIS" Cgroup="CORE" />
    </condition> 

