leonlee-scut/JFlash_Devices_Gen/Puya.PY32F0xx_DFP.1.2.19.pdsc
    <condition id="PY32F072 ARMCC">
      <description>Puya PY32F072 Devices and ARMCC Compiler</description>
      <require condition="PY32F072"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="PY32F072 CMSIS">
      <description>Puya PY32F072 Devices and CMSIS-CORE</description>
      <require condition="PY32F072"/>
      <require Cclass="CMSIS" Cgroup="CORE" />
    </condition> 

    <condition id="PY32F072E ARMCC">
      <description>Puya PY32F072E Devices and ARMCC Compiler</description>
      <require condition="PY32F072E"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="PY32F072E CMSIS">
      <description>Puya PY32F072E Devices and CMSIS-CORE</description>
      <require condition="PY32F072E"/>
      <require Cclass="CMSIS" Cgroup="CORE" />
    </condition> 

    <condition id="PY32F090 ARMCC">
      <description>Puya PY32F090 Devices and ARMCC Compiler</description>
      <require condition="PY32F090"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="PY32F090 CMSIS">
      <description>Puya PY32F090 Devices and CMSIS-CORE</description>
      <require condition="PY32F090"/>
      <require Cclass="CMSIS" Cgroup="CORE" />
    </condition> 

    <condition id="PY32F092 ARMCC">
      <description>Puya PY32F092 Devices and ARMCC Compiler</description>
      <require condition="PY32F092"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="PY32F092 CMSIS">
      <description>Puya PY32F092 Devices and CMSIS-CORE</description>
      <require condition="PY32F092"/>
      <require Cclass="CMSIS" Cgroup="CORE" />
    </condition> 

  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="PY32F0 CMSIS">
      <description>System Startup for Puya PY32F0 Series</description>
      <files>
        <!--  include folder -->
        <file category="include" name="Drivers/CMSIS/Device/PY32F0xx/Include/"/>
        <!-- common device header file -->
        <file category="header" name="Drivers/CMSIS/Device/PY32F0xx/Include/py32f0xx.h"/>

        <file category="source" condition="PY32F002A ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/arm/startup_py32f002xx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F002B ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/arm/startup_py32f002bxx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F002C ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/arm/startup_py32f002cxx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F002X ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/arm/startup_py32f002xxx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F002Z ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/arm/startup_py32f002zxx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F003 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/arm/startup_py32f003xx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F005 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/arm/startup_py32f005xx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F006 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/arm/startup_py32f006xx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F020B ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/arm/startup_py32f020xx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F021 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/arm/startup_py32f021xx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F030 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/arm/startup_py32f030xx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F031 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/arm/startup_py32f031xx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F032 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/arm/startup_py32f032xx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F033 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/arm/startup_py32f033xx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F040 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/arm/startup_py32f040xx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F040E ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/arm/startup_py32f040exx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F071 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/arm/startup_py32f071xx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F071E ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/arm/startup_py32f071exx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F072 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/arm/startup_py32f072xx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F072E ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/arm/startup_py32f072exx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F090 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/arm/startup_py32f090xx.s" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F092 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/arm/startup_py32f092xx.s" attr="config" version="1.0.0"/>


        <file category="source" condition="PY32F002A ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/system_py32f0xx.c" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F002B ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/system_py32f002b.c" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F002C ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/system_py32f002c.c" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F002X ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/system_py32f002x.c" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F002Z ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/system_py32f002z.c" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F003 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/system_py32f0xx.c" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F005 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/system_py32f005.c" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F006 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/system_py32f006.c" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F020B ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/system_py32f020.c" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F021 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/system_py32f021.c" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F030 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/system_py32f0xx.c" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F031 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/system_py32f031.c" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F032 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/system_py32f032.c" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F033 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/system_py32f033.c" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F040 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/system_py32f040.c" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F040E ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/system_py32f040e.c" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F071 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/system_py32f071.c" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F071E ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/system_py32f071e.c" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F072 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/system_py32f072.c" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F072E ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/system_py32f072e.c" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F090 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/system_py32f090.c" attr="config" version="1.0.0"/>
        <file category="source" condition="PY32F092 ARMCC" name="Drivers/CMSIS/Device/PY32F0xx/Source/system_py32f092.c" attr="config" version="1.0.0"/>
     
      </files>
    </component>
  </components>
</package>
